import React from 'react';
import styles from './Privacy.module.scss';
import { Link } from 'react-router-dom';

export const Privacy = (): React.JSX.Element => {
    return (
        <div className="container">
            <div className={styles.privacy}>
                <h1 className={styles.privacy__title}>Политика конфиденциальности персональных данных</h1>

                <ol className={styles.privacy__list}>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Общие положения</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                Настоящая политика обработки персональных данных (далее – Политика конфиденциальности)
                                составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О
                                персональных данных» определяет порядок обработки персональных данных и меры по
                                обеспечению безопасности персональных данных, предпринимаемые «YouAuto» (далее –
                                Администрация сайта), действует в отношении всей информации, которую сайт usecar.ru,
                                (далее – usecar.ru) расположенный на доменном имени usecar.ru (а также его субдоменах),
                                может получить о Пользователе во время использования сайта usecar.ru (а также его
                                субдоменов), его программ и его продуктов.
                            </li>
                        </ol>
                    </li>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Определение терминов</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                В настоящей Политике конфиденциальности используются следующие термины:
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «Администрация сайта» (далее – Администрация) – уполномоченные сотрудники на управление
                                сайтом usecar.ru, действующие от имени «ООО "МАГНАТ АВТО"», которые организуют и (или)
                                осуществляют обработку персональных данных, а также определяет цели обработки
                                персональных данных, состав персональных данных, подлежащих обработке, действия
                                (операции), совершаемые с персональными данными.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «Персональные данные» - любая информация, относящаяся к прямо или косвенно
                                определенному, или определяемому физическому лицу (субъекту персональных данных).
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «Обработка персональных данных» - любое действие (операция) или совокупность действий
                                (операций), совершаемых с использованием средств автоматизации или без использования
                                таких средств с персональными данными, включая сбор, запись, систематизацию, накопление,
                                хранение, уточнение (обновление, изменение), извлечение, использование, передачу
                                (распространение, предоставление, доступ), обезличивание, блокирование, удаление,
                                уничтожение персональных данных.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или
                                иным получившим доступ к персональным данным лицом требование не допускать их
                                распространения без согласия субъекта персональных данных или наличия иного законного
                                основания.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «Сайт avt-market.ru» - это совокупность связанных между собой веб-страниц, размещенных в
                                сети Интернет по уникальному адресу (URL): usecar.ru, а также его субдоменах.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «Субдомены» - это страницы или совокупность страниц, расположенные на доменах третьего
                                уровня, принадлежащие сайту usecar.ru, а также другие временные страницы, внизу который
                                указана контактная информация Администрации
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «Пользователь сайта usecar.ru » (далее Пользователь) – лицо, имеющее доступ к сайту
                                usecar.ru, посредством сети Интернет и использующее информацию, материалы и продукты
                                сайта usecar.ru.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на
                                компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает
                                веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, через который
                                Пользователь получает доступ на usecar.ru.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                «Товар » - продукт, который Пользователь заказывает на сайте и оплачивает через
                                платёжные системы.
                            </li>
                        </ol>
                    </li>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Общие положения</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                Использование сайта usecar.ru Пользователем означает согласие с настоящей Политикой
                                конфиденциальности и условиями обработки персональных данных Пользователя.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                В случае несогласия с условиями Политики конфиденциальности Пользователь должен
                                прекратить использование сайта usecar.ru .
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Настоящая Политика конфиденциальности применяется к сайту usecar.ru. usecar.ru не
                                контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь
                                может перейти по ссылкам, доступным на сайте usecar.ru.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Администрация не проверяет достоверность персональных данных, предоставляемых
                                Пользователем.
                            </li>
                        </ol>
                    </li>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Предмет политики конфиденциальности</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                Настоящая Политика конфиденциальности устанавливает обязательства Администрации по
                                неразглашению и обеспечению режима защиты конфиденциальности персональных данных,
                                которые Пользователь предоставляет по запросу Администрации при регистрации на сайте
                                usecar.ru, при подписке на информационную e-mail рассылку или при оформлении заказа.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Персональные данные, разрешённые к обработке в рамках настоящей Политики
                                конфиденциальности, предоставляются Пользователем путём заполнения форм на сайте
                                usecar.ru и включают в себя следующую информацию:
                                <ul className={styles.privacy__extra_list}>
                                    <li>фамилию, имя, отчество Пользователя</li>
                                    <li>контактный телефон Пользователя</li>
                                    <li>дата рождения</li>
                                    <li>место жительство Пользователя</li>
                                    <li>информация об автомобиле.</li>
                                </ul>
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч.
                                файлов «cookie») с помощью сервисов интернет-статистики (Яндекс Метрика и Гугл Аналитика
                                и других).
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                usecar.ru защищает Данные, которые автоматически передаются при посещении страниц:
                                <ul className={styles.privacy__extra_list}>
                                    <li>IP адрес;</li>
                                    <li>информация из cookies;</li>
                                    <li>информация о браузере</li>
                                    <li>время доступа;</li>
                                    <li>реферер (адрес предыдущей страницы).</li>
                                </ul>
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Отключение cookies может повлечь невозможность доступа к частям сайта , требующим
                                авторизации.{' '}
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                usecar.ru осуществляет сбор статистики об IP-адресах своих посетителей. Данная
                                информация используется с целью предотвращения, выявления и решения технических проблем.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Любая иная персональная информация неоговоренная выше (история посещения, используемые
                                браузеры, операционные системы и т.д.) подлежит надежному хранению и нераспространению,
                                за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики
                                конфиденциальности.
                            </li>
                        </ol>
                    </li>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Цели сбора персональной информации пользователя</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                Персональные данные Пользователя Администрация может использовать в целях:
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Установления с Пользователем обратной связи, включая направление уведомлений, запросов,
                                касающихся использования сайта usecar.ru, оказания услуг и обработки запросов и заявок
                                от Пользователя.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Определения места нахождения Пользователя для обеспечения безопасности, предотвращения
                                мошенничества.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Подтверждения достоверности и полноты персональных данных, предоставленных
                                Пользователем.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Создания учетной записи для использования частей сайта usecar.ru, если Пользователь дал
                                согласие на создание учетной записи.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Предоставления Пользователю эффективной технической поддержки при возникновении проблем,
                                связанных с использованием сайта usecar.ru.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Предоставления Пользователю с его согласия специальных предложений, информации о ценах,
                                новостной рассылки и иных сведений от имени сайта usecar.ru.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Осуществления рекламной деятельности с согласия Пользователя.
                            </li>
                        </ol>
                    </li>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Способы и сроки обработки персональной информации</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                Обработка персональных данных Пользователя осуществляется без ограничения срока, любым
                                законным способом, в том числе в информационных системах персональных данных с
                                использованием средств автоматизации или без использования таких средств.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Пользователь соглашается с тем, что Администрация вправе передавать персональные данные
                                третьим лицам, в частности, операторам электросвязи, исключительно в целях выполнения
                                заказа Пользователя, оформленного на сайте usecar.ru.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Персональные данные Пользователя могут быть переданы уполномоченным органам
                                государственной власти Российской Федерации только по основаниям и в порядке,
                                установленным законодательством Российской Федерации.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                При утрате или разглашении персональных данных Администрация вправе не информировать
                                Пользователя об утрате или разглашении персональных данных.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                {' '}
                                Администрация принимает необходимые организационные и технические меры для защиты
                                персональной информации Пользователя от неправомерного или случайного доступа,
                                уничтожения, изменения, блокирования, копирования, распространения, а также от иных
                                неправомерных действий третьих лиц.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Администрация совместно с Пользователем принимает все необходимые меры по предотвращению
                                убытков или иных отрицательных последствий, вызванных утратой или разглашением
                                персональных данных Пользователя.
                            </li>
                        </ol>
                    </li>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Права и обязанности сторон</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                Пользователь вправе:
                                <ul className={styles.privacy__extra_list}>
                                    <li>
                                        Принимать свободное решение о предоставлении своих персональных данных,
                                        необходимых для использования сайта usecar.ru, и давать согласие на их
                                        обработку.
                                    </li>
                                    <li>
                                        Обновить, дополнить предоставленную информацию о персональных данных в случае
                                        изменения данной информации.
                                    </li>
                                    <li>
                                        Пользователь имеет право на получение у Администрации информации, касающейся
                                        обработки его персональных данных, если такое право не ограничено в соответствии
                                        с федеральными законами. Пользователь вправе требовать от Администрации
                                        уточнения его персональных данных, их блокирования или уничтожения в случае,
                                        если персональные данные являются неполными, устаревшими, неточными, незаконно
                                        полученными или не являются необходимыми для заявленной цели обработки, а также
                                        принимать предусмотренные законом меры по защите своих прав.
                                    </li>
                                </ul>
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Администрация обязана:
                                <ul className={styles.privacy__extra_list}>
                                    <li>
                                        Использовать полученную информацию исключительно для целей, указанных в п. 4
                                        настоящей Политики конфиденциальности.
                                    </li>
                                    <li>
                                        Обеспечить хранение конфиденциальной информации в тайне, не разглашать без
                                        предварительного письменного разрешения Пользователя, а также не осуществлять
                                        продажу, обмен, опубликование, либо разглашение иными возможными способами
                                        переданных персональных данных Пользователя, за исключением п.п. 5.2 и 5.3.
                                        настоящей Политики Конфиденциальности.
                                    </li>
                                    <li>
                                        Принимать меры предосторожности для защиты конфиденциальности персональных
                                        данных Пользователя согласно порядку, обычно используемого для защиты такого
                                        рода информации в существующем деловом обороте.
                                    </li>
                                    <li>
                                        Осуществить блокирование персональных данных, относящихся к соответствующему
                                        Пользователю, с момента обращения или запроса Пользователя, или его законного
                                        представителя либо уполномоченного органа по защите прав субъектов персональных
                                        данных на период проверки, в случае выявления недостоверных персональных данных
                                        или неправомерных действий.
                                    </li>
                                </ul>
                            </li>
                        </ol>
                    </li>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Ответственность сторон</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                Администрация, не исполнившая свои обязательства, несёт ответственность за убытки,
                                понесённые Пользователем в связи с неправомерным использованием персональных данных, в
                                соответствии с законодательством Российской Федерации, за исключением случаев,
                                предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                В случае утраты или разглашения Конфиденциальной информации Администрация не несёт
                                ответственность, если данная конфиденциальная информация:
                                <ul className={styles.privacy__extra_list}>
                                    <li>Стала публичным достоянием до её утраты или разглашения.</li>
                                    <li>
                                        Была получена от третьей стороны до момента её получения Администрацией Ресурса.
                                    </li>
                                    <li>Была разглашена с согласия Пользователя.</li>
                                </ul>
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Пользователь несет полную ответственность за соблюдение требований законодательства РФ,
                                в том числе законов о рекламе, о защите авторских и смежных прав, об охране товарных
                                знаков и знаков обслуживания, но не ограничиваясь перечисленным, включая полную
                                ответственность за содержание и форму материалов.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Пользователь признает, что ответственность за любую информацию (в том числе, но не
                                ограничиваясь: файлы с данными, тексты и т. д.), к которой он может иметь доступ как к
                                части сайта usecar.ru, несет лицо, предоставившее такую информацию.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Пользователь соглашается, что информация, предоставленная ему как часть сайта usecar.ru,
                                может являться объектом интеллектуальной собственности, права на который защищены и
                                принадлежат другим Пользователям, партнерам или рекламодателям, которые размещают такую
                                информацию на сайте usecar.ru. Пользователь не вправе вносить изменения, передавать в
                                аренду, передавать на условиях займа, продавать, распространять или создавать
                                производные работы на основе такого Содержания (полностью или в части), за исключением
                                случаев, когда такие действия были письменно прямо разрешены собственниками такого
                                Содержания в соответствии с условиями отдельного соглашения.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                В отношение текстовых материалов (статей, публикаций, находящихся в свободном публичном
                                доступе на сайте usecar.ru) допускается их распространение при условии, что будет дана
                                ссылка на usecar.ru.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Администрация не несет ответственности перед Пользователем за любой убыток или ущерб,
                                понесенный Пользователем в результате удаления, сбоя или невозможности сохранения
                                какого-либо Содержания и иных коммуникационных данных, содержащихся на сайте usecar.ru
                                или передаваемых через него.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Администрация не несет ответственности за любые прямые или косвенные убытки,
                                произошедшие из-за: использования либо невозможности использования сайта, либо отдельных
                                сервисов; несанкционированного доступа к коммуникациям Пользователя; заявления или
                                поведение любого третьего лица на сайте.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Администрация не несет ответственность за какую-либо информацию, размещенную
                                пользователем на сайте usecar.ru, включая, но не ограничиваясь: информацию, защищенную
                                авторским правом, без прямого согласия владельца авторского права.
                            </li>
                        </ol>
                    </li>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Разрешение споров</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и
                                Администрацией, обязательным является предъявление претензии (письменного предложения
                                или предложения в электронном виде о добровольном урегулировании спора).
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно
                                или в электронном виде уведомляет заявителя претензии о результатах рассмотрения
                                претензии.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                {' '}
                                При не достижении соглашения спор будет передан на рассмотрение Арбитражного суда г.
                                Москва.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                К настоящей Политике конфиденциальности и отношениям между Пользователем и
                                Администрацией применяется действующее законодательство Российской Федерации.
                            </li>
                        </ol>
                    </li>
                    <li className={styles.privacy__item}>
                        <h2 className={styles.privacy__subtitle}>Дополнительные условия</h2>
                        <ol className={styles.privacy__sublist}>
                            <li className={styles.privacy__sublist_item}>
                                Администрация вправе вносить изменения в настоящую Политику конфиденциальности без
                                согласия Пользователя.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте
                                usecar.ru, если иное не предусмотрено новой редакцией Политики конфиденциальности.
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Все предложения или вопросы касательно настоящей Политики конфиденциальности следует
                                сообщать по адресу
                            </li>
                            <li className={styles.privacy__sublist_item}>
                                Действующая Политика конфиденциальности размещена на странице по адресу
                                <Link to={'/privacy'}>https://usecar.ru/privacy</Link>
                            </li>
                        </ol>
                    </li>
                </ol>

                <p>
                    Обновлено: <time dateTime="2021-03-01">01 марта 2021 года</time>
                    <br />
                    Свердловская область, ООО "МАГНАТ АВТО"
                </p>
            </div>
        </div>
    );
};
