import React from 'react';
import styles from './FooterDisclaimer.module.scss';

export const FooterDisclaimer = (): React.JSX.Element => {
    return (
        <article className={styles.footer_disclaimer}>
            <p>
                Годовая ставка автокредита варьируется от 4.9% до 16.5% и зависит от конкретного банка, суммы займа и
                кредитной программы. Минимальный срок погашения от 2 месяцев, максимальный - 96 месяцев. При этом любые
                дополнительные комиссии автоцентром не взимаются.
            </p>
            <p>
                Данный Интернет-сайт носит исключительно информационный характер и ни при каких условиях не является
                публичной офертой, определяемой положениями Статьи 437 Гражданского кодекса РФ. Для получения подробной
                информации о наличии и стоимости указанных товаров и (или) услуг, пожалуйста, обращайтесь к менеджерам
                автоцентра.
            </p>
            <p>
                Кредит предоставляется банком АО «Т-Банк». Лицензия ЦБ РФ № 2673 от 09.07.2024. Обязательное страхование
                гражданской ответственности владельцев транспортных средств осуществляется АО "Т-Страхование"{' '}
                <img src="https://api-used.ru/images/banks/c7d6/3b4786887/tinkoff.svg" alt="t-bank" /> по лицензии ОС№
                0191-03 от 01.07.2024 г.
            </p>
        </article>
    );
};
